src/testsuite_old/sysbench/results/oltp_write_only.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 407.92 qps: 2454.28 (r/w/o: 0.00/1636.30/817.98) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 352.05 qps: 2105.40 (r/w/o: 0.00/1401.30/704.10) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 310.80 qps: 1877.60 (r/w/o: 0.00/1256.00/621.60) lat (ms,95%): 450.77 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           86884
        other:                           43506
        total:                           130390
    transactions:                        21785  (362.28 per sec.)
    queries:                             130390 (2168.34 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      362.2773
    time elapsed:                        60.1346s
    total number of events:              21785

Latency (ms):
         min:                                   41.60
         avg:                                  176.98
         max:                                  783.13
         95th percentile:                      331.91
         sum:                              3855438.47

Threads fairness:
    events (avg/stddev):           340.3906/2.78
    execution time (avg/stddev):   60.2412/0.02

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 343.69 qps: 2072.82 (r/w/o: 0.00/1383.30/689.52) lat (ms,95%): 376.49 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 489.75 qps: 2938.50 (r/w/o: 0.00/1959.00/979.50) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 674.95 qps: 4049.70 (r/w/o: 0.00/2699.80/1349.90) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           121012
        other:                           60570
        total:                           181582
    transactions:                        30317  (504.54 per sec.)
    queries:                             181582 (3021.89 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      504.5366
    time elapsed:                        60.0901s
    total number of events:              30317

Latency (ms):
         min:                                   33.28
         avg:                                  126.99
         max:                                  942.22
         95th percentile:                      244.38
         sum:                              3849999.10

Threads fairness:
    events (avg/stddev):           473.7031/5.05
    execution time (avg/stddev):   60.1562/0.01